#define s = Character('Sylvie', color="#c8ffc8")
#define m = Character('Me', color="#c8c8ff")

define e = Character('Ерік', color="#77099c")
define m = Character('Мама Кейт', color="#ff70cf")
define f = Character('Тато Гаррі', color="#0be313")
define k = Character('Карл', color="#ff7700")
define t = Character('Дід Том', color="#0d00ff")
define h = Character('Ханна', color="#ff0808")
define c = Character('Кігеть', color="#04ff00")
define d = Character('Ікло', color="#d4ff00")

define audio.gav = "music/gav.mp3"
define audio.ruk = "music/ruk.mp3"
    
label start: 
        
    scene comp 
        
    "Як завжди я прокинувся зранку і сів за комп (Ну що ж робити на літніх канікулах  ще)."
    
    m "Знову за компом?"
    
    "Я зрозумів що ще була мама."
    
    scene room
    
    with fade
    
    show mother
    
    e " А шо?"
    
    m "Як ти зі мною розмовляєш?"
    
    m "Ну все це була остання крапля. Давай збирайся, завтра їдемо до твого діда."
    
    e "Він ж живе на старій фермі в іншому штаті."
    
    m "Так, пожевеш там і подумаєш над своєю поведінкою."
    
    m "Тому давай збирай речі."
    
    e "Добре мамо."
    
    scene comp
    
    with fade
    
    hide mother   
    
    "І я далі сидів в компі."
    
    "Я навіть не знаю як діда звати."
    
    "Мабуть треба буде запитати тата, бо після цього вже я не збираюся розмовляти з мамой."
    
    "Весь час я сижу в компі, заняться ж нема чим."
        
    "Але батькам це чомусь не подобається."
        
    "Ну ладно. Хоча може в мене ще є шанс вговорити тата."
    
    m "Ерік. Іди вечеряти."
    
    "Це погукала мама."
    
    e "Іду."
        
    scene kitchen
    
    with fade
    
    "Коли я зайшов на кухню я побачив маму і тата."
    
    show father at right
    show mother 
    
    "Дивно. Я не чув як тато прийшов з роботи. Хоча що тут дивно. Коли сидиш в комп'ютері час летить неймовірно швидко і ти нічого не помічаєш."        
    
    f "Привіт Ерік. Ну що готовий їхати до діда."
    
    e "Нуу так. А до речі ти не знаєш як діда звати?"        
        
    m "Ерік, ти знущаєшся, ти не знаєш як звати рідного діда?"
    
    f "Люба заспокойся, все добре. Ерік його бачив тільки один раз на Різдво і то йому був один рік."
    
    "Тато перебив маму."
    
    f "Його звати Том."
    
    "Це вже тато до мене."
    
    e "Тату."
    
    f "Що Еріку. Якщо ти про те чи можна тобі не їхати, то ні. Ти поїдеш діда Тома."
        
    e "Ні, я хотів запитати чому він не ї'здить до нас на Різдво?"
    
    f "Ну Еріку. Коли твій дідусь Том збирався їхати з твоєю бабусею Олівією і їхньою дочкою Ханною якій зараз теж 13 років як і тобі. І перед Різдвом Ханна захворіла застудою."
    
    f "Твій дідусь дуже сильно хотів тебе побачити тому залишив Олівію і Ханну самих, а сам поїхав до нас. І коли він повернувся то Олівії вже не було в живих."
    
    e "А що сталося?"
    
    f "На них напали розбійники, тілльки Ханна встигла врятуватися заховавшись в діжці у хліві. Коли твій дід Том приїхав то знайшов мертвою свою дружину, і налякану Ханну. І розбійники вкрали всі дорогоціності і спалили його дім... "
    
    hide father
    hide mother
    
    scene room    
    with fade
    
    "Після вечері я пішов знову у кімнату. Сидіть в компі не хотілось."
    
    "Тому я просто ліг на ліжко."
    
    "Ну може на фермі і не буде так погано..."
    
    "Я склав речі і ліг спати."
    
    scene room_dark
    with fade
    
    "Я прокинувся посеред ночі."
    
    "Можна втекти бо у батьків міцний сон, але що далі робити? Ну може щось придимаю."
    
    menu:
        "Що робити?"
        
        "Втекти з дома.":
            jump vtekti
          
        "Лягти спати.":
            jump zalishitsa
            
label vtekti:
    
    "Треба взяти все найнеобхідніше..."
    "Я вийшов на вулицю."
    
    scene lix
    with fade
    
    "Може вернутися назад додому або можна до мого друга Карла (його батьки поїхали у відрядження, з ним я підримує зв'язок в соцсетах.)."
    
    menu:
        "Що робити?"
        
        "Повернутися до дому.":
            jump zalishitsa
          
        "Піти до Карла":
            jump do_karla          


label do_karla:
    
    scene street1
    with fade
    
    scene peron
    with fade
        
    scene metro
    with fade   
    
    scene street2
    with fade
    
    scene street3
    with fade
    
    scene street4
    with fade
    
    scene street5
    with fade
    
    scene street6
    with fade
    
    scene street7
    with fade
    
    scene karl_room_night
    with fade
    
    "Я прийшов до Карла."
    
    show karl
    
    e "Привіт Карл."
    
    k "Привіт Еріку."
        
    e "А де мені можна лягти?"
    
    k "Та куди хочеш."
    
    e "Ok."
    
    hide karl
    
    scene blak
    with fade
    
    "Я так втомився що зразу заснув."
    "Zzz"
    
    "Сонце било в очі."
    
    scene karl_room
    with fade
    
    show karl
    
    k "О прокинувся соння. Як спалось?"
    
    e "Норм."
    
    k "Снідать будеш?"
    
    e "Так. А що є?"
    
    k "Макарони з омлетом."
    
    e "Дякую."
    
    hide karl
    
    "Мдам макорони були недоварені, а омлет навпаки був пережарений і пересолений. Ну ладно їж що дають, вже й за це дякую."
    
    show karl
        
    "Коли я подивився в телефон то побачив що у мене 8 пропущених від тата і 6 пропущених від мами."
    
    k "Хтось стукає, я зараз подивлюсь хто там."
    
    e "Нііі не відкривай двері!!!"
    
    "Але вже було пізно і у дверях стояли тато і мама."
    
    show mother at left
    show father at right
    
    m "Привіт Карле. Ти Еріка небачив? "
    
    m "О, а ось і Ерік."
    
    k "Ддобррий ддень."
    
    "Я хотів втекти, але тато мене спіймав."
    
    f "Привіт Еріку."
    
    e "А а як ви мене знайшли?"
    
    m "Еріку, якщо ти думаєш що ми відсталі пенсіонери від сучасних технологій то це не так. У твойому годиннику стоїть функція місцезнаходження."
    
    e "А чому ви так довго мене шукали?"

    f "Нуу ми ж домовлялися прокидаємося в 6:00."
    
    e "Так. Все правильно."
    
    m "І ми подумали що ти можеш виспатись і дали тобі ще 2 годинни поспати."
    
    e "Припустимо."
    
    m "І коли о 8:00 до тебе зайшли то тебе там не було."
    
    e "Нуу і."
    
    f "На твоюму місці я б помовчав. Зрозумів."
    
    e "Так."
    
    m "Ну і ми почали дзвонити твоїм друзям. І добре що Гаррі згадав що в у твойому годиннику є така фунуція."
    
    f "Що стоїш Еріку, поїхали додому."
    
    e "Добре. Пока Карл."
    
    f "Пішов швидко."
    
    "Видно тато вийшов з себе, але на диво мама була спокійна."
    
    m "Пока Карле."
    
    k "Допобачення місіс Кейт."
    
    "~Мабуть тато був настільки злий, що пішов не попрощавшись.~"
    
    hide mother
    hide father
    hide karl
    
    scene street7
    with fade
    scene street6
    with fade
    scene street5
    with fade
    scene street4
    with fade
    scene street3
    with fade
    scene street2
    with fade
    scene street1
    with fade
    scene room
    with fade
    
    show mother 
    show father at right
    
    f "Щоб це був перший і останній раз. Цього разу ми не будемо тебе карати, а якщо наступного разу, то краще щоб не було наступного разу. Зрозумів?"
    
    e "Угу."
    
    f "Що? Скажи нормально."
    
    e "Зрозумів."
    
    m "Точно зрозумів."

    e "Так, зрозумів."
    
    "~Та зрозумів вже, що не зрозуміло?~"
    
    f "Ну дивись мені."
    
    "Батьки вийшли з кімнати."
    
    "А тим часом життя продовжувалось і я не тікав з дому і до діда Тома батьки вже не відправляли."
    
    return
    
label zalishitsa:
        
    scene blak
    with fade
    
    "Zzz"        
    
    scene blak
    with fade
    
    m "Еріку, вставай."
    
    scene room_morning
    show mother
    
    m "Ерік. Вставай. Ми і так дали тобі поспати ще дві годинни."
    
    e "Добрий ранок мам."
    
    m "Добрий ранок."
    
    m "Давай вставай і йди їсти."
    
    e "Добре мамо."
    
    e "Мам а що на сніданок?"    
    
    m "Що хочеш картоплю фрі чи піцу?"
    
    menu:
        "Що вибрати"
        
        "Картопля фрі":
            jump go_to_farm
          
        "Піца":
            jump go_to_farm 
                        
label go_to_farm:
    
    hide mother
    
    scene car
    with fade
    
    show father at left
    show mother
    
    f "Всі готові?"
    
    m "Так."
    
    e "Угу."
    
    f "Тоді поїхали."
    
    hide mother
    hide father
    
    scene street01
    with fade
   
    scene street02
    with fade
   
    scene street03
    with fade
   
    scene road1
    with fade
    
    scene field2
    with fade 
    
    scene field1
    with fade
    
    scene forest4
    with fade 
    
    scene desert1
    with fade
   
    scene forest1
    with fade
   
    scene forest2
    with fade
   
    scene field3
    with fade
   
    scene field4
    with fade
   
    scene bridge1
    with fade
   
    scene field5
    with fade
   
    scene forest5
    with fade
   
    scene forest3
    with fade
   
    scene field6
    with fade 
    
    scene farm
    with fade 
    
    show mother at right
    show father at left
    
    f "Приїхали, ехх, місце де я провів все своє дитинство.Еххх."
    
    e "Фуух, нарешті приїхали."
    
    m "Ми сьогодні з Гаррі тут переночуємо, а завтра поїдемо назад додому."
    
    show tom at center
    
    t "О, приїхали. Привіт Кейт, синок, мій любий Гаррі, о а це хто у нас, це наший Едік, так?"
    
    e "Так, тільки Ерік."
    
    t "Ехх Ерік, Едік. Одне і теж."
    
    f "Привіт тату."
    
    m "Добрий день."
    
    m "Я піду постелю постелю нам з Гаррі."    
    
    hide mother
    
    t "Ехх, скільки це ми не бачились?"
    
    f "1,2,3,4...12 так 12 років. Тату, а де це Ханна."
   
    show hanna at right
    
    h "Привіт Гаррі, а ти мабуть Ерік?"
    
    e "Так, а ти мабуть Ханна."
    
    h "Так."
    
    f "О, привіт Ханна."
        
    t "Ханна, йди приготуй гостям вечерю."
    
    h "Добре тату."
    
    hide hanna
    
    "Ханна пішла на кухню."
    
    menu:
        
        "Що робити?"
        
        "Допомогти Ханні.":            
            jump help_Xanna
        
        "Нічого не робити.":
            jump stoat
            
label help_Xanna:
    
    scene kitchen1
    with fade
    
    show hanna
    
    e "Хай Ханно. Прийшов тобі допомогти."
    
    h "Добре, Еріку. Ось..."
    
    "Ми зробили пасту, видно що Ханна вже не один рік готує, я їй мабуть не допомагав, а навпаки заважав, але вона не виказувала це."  
    
    jump de_spat
    
label stoat:
    
    "Тато і дідусь Том розмовляли про щось своє, я не хотів долучатися до їхньої розмови, тому дістав телефон і побачив що тут не ловить ні зв'язок і тим паче інтернет. Я хотів зіграти в якусь гру, але у мене були ігри тільки з інтернетом. Та і розетки тут мабуть немеє."
    
    show mother at right
    
    m "Еріку, телефон тобі не знадобтиться."
    
    "Після цих слів вона забрала у мене телефон."
    
    hide mother
    hide tom
    hide father
    
    "Ханна покликала нас всіх на вечерю. На вечерю була паста, у неї мабуть кулінарний талант."
    
    jump de_spat
    
label de_spat:
     
    scene blak
    with fade
     
    "Після вечері мені повідомили що я можу вибрати де лягти спати на весь час мого перебування в діда Тома."
    "Мені запропонували лягти на горищі або в кімнаті Ханни."
    
    menu:
        "Де лягти спати?"
        
        "На горищі":
            jump attic
        
        "В кімнаті Ханни":
            jump room_h
    
label attic:
    
    "Попрощавшись з батьками(вони виїжатимуть рано в ранці) я пішов до своєї кімнати."
    
    scene attic
    with fade
    
    "Мдам кімната не з найкращих, але дякую вже за це."
    
    scene blak
    with fade    
    
    "Мабуть з дідом Томом я краще познайомлюся завтра."
    
    "Zzz"
    
    "Я прокинувся."
    
    scene attic
    with fade
    
    "~Видно по сонцю вже десь десята.~"
    
    "Я одягнувся і тільки зараз помітив що тут бігають"
    
    e "МИШІіііііііі"
    
    "Я неавиджу мишей і кажанів."
    
    "~Мабуть краще було б спати в кімнаті Ханни. Але я вже вибрав горище то і буду жити на горищі, я б осромився перед Ханною і дідом Томом, якби я спитав чи можу я переїхати до Ханни, тому прийдеться жити на горищі.~"
    
    "~Але є плюси це моя 'берлога'. Тепер я буду горище називати берлогою.~"
    
    scene living_room
    with fade
    
    show tom
    
    "Пішов у вітальню. Там я зустрів діда Тома. Він читав книгу."
    
    t "О, прокинувся Едік. Як спалосью"
    
    e "Нормально, тільки я Ерік."
    
    t "Ерік, Едік одне і теж. Ну добре у нас є справи поважливіше. Йди поїж ,а потім я тобі розповім що тобі робити."
    
    e "Добре діду Томе."
    
    t "Ой, Еріку як не рідний називай мене просто Томом, зрозумів Том."
    
    e "Добре діду тобто Томе."
    
    t "Ну це вже краще. А тепер йди їж зустрінимося у хліві."
    
    e "Добре Томе."
    
    scene kitchen1
    with fade
    
    "Я пішов снідати на кухню Ханни там не було і я подумав що вона ще спить. На снідонок була вчорашня паста. Я швидко поїв, і помив після себе посуд. І як казав Том, я пішов у хлів"
    
    scene hliv
    with fade
    
    show tom
    show hanna at right
    
    "Коли я зайшов у хлів я побачив Тома який прибирав у свиней і Ханну яка доїла корову."
    
    e "Добрий ранок Ханно, а я думав що ти ще спиш."
    
    h "Добрий ранок і тобі Еріку, я вже давно встала. Я вже всіх корів подоїла крім цієї."
    
    e "А зрозумів. Томе Ви казали зайти до Вас у хлів."
    
    t "А, так"
    
    "Том зупинився працювати."
    
    t "Тільки давай на ти."
    
    e "Якщо що я після себе помив посуд."
    
    t "Добре Еріку, але тут по посуду і їжі головна Ханна. Так Ханна?"
    
    h "Так, тату."
    
    t "Так, твоя задача на сьогоднішній день: поприбирати у своїй кімнаті і потравить там мишей. Зрозумів Еріку?"
    
    e "Так ді... тобото так Томе."
    
    t "Тоді йди працюй."
    
    scene attic
    with fade
    
    "Я пішов у свою 'Берлогу'"
    
    "При денному світлі було видно всю 'красу' кімнати."
    
    "Для початку я озброївся віником, шваброю і ганчірками."
    
    scene blak
    with fade
    
    "Після того як я розібрав завали меблів, позамітав і помив підлогу, і потруїв мишей. Я вирішив піти знайти Тома."
    
    "Я вирішив піти у вітальню."
    
    scene living_room
    with fade
    
    "Але його там не було."
    
    "Тому вирішив піти у хлів."
    
    scene farm
    with fade
    
    scene hliv 
    with fade

    "Але там його теж не було."
    
    "Я вийшов на подвір'я."
    
    scene farm
    with fade
    
    "Біля будинку стояли деякі споруди: хлів, щось схоже на майстерню, склад, і ще якісь споруди."
        
    "По сонцю зараз ніби четверта вечора."
    
    "На вулиці стояла нестерпна спека."
    
    "Я вирішив що краще піти в будинок, щоб сховатися від цієї спеки. Для початку я вирішив зайти на кухню"
    
    scene kitchen1
    with fade
    
    "Але там нікого не було."
    
    "Я вирішив зайти в кімнату Ханни."
    
    scene door_h
    with fade
    
    "Я вирішив постукати, може Ханна там."
    
    "Тук тук"
    
    h "Заходьте."
        
    scene room_h
    with fade
    
    show hanna
    show cat at left
    
    "Я зайшов в кімнату Ханни."
    
    "Я побачив Ханну яка гладила кота."
    
    h "Привіт Еріку."
    
    e "Привіт, Ханно. О, а як її звати?"
    
    h "Це хлопчик, його звати Кігеть."
    
    c "Мяу, ххххх."
    
    h "Кігтю заспокойся, все добре. Це Ерік, наший друг. Він тебе нескривдить, так Еріку?"
    
    e "Так, Кігтю, я тебе нескривжу."
    
    c "Мяу мяуу."
    
    "Кігеть зістрибнув з ліжка і почав мене розглядати, а в кінці потерся об мої ноги і пішов назад до Ханни."
    
    h "Ти Кігтові сподобався."
    
    e "От і добре."
    
    h "Ну що поприбирав на горищі?"
    
    e "Так. А ти не знаєш де Том?"
    
    h "Знаю, він у майстерні. А що?"
    
    e "Та треба йому сказати що я поприбирав на горищі."
    
    h "Ти нікуди не підеш."
    
    e "Чому."
    
    h "Бо тобі треба поїсти."
    
    "І тільки зараз я зрозумів що я голоний як вовк."
    
    e "Згоден з тобою, Ханно."
    
    "Ми пішли на кухню."
    
    scene kitchen1
    with fade
    
    show hanna
    
    h "Еріку почекаєш поки я приготую макарони?"
    
    e "Так звісно."
    
    scene blak
    with fade
    
    "Я задрімав на стільці, мабуть прибирання дало своє."
    "Zzz"
    
    h "Еріку ти що спиш?"

    e "Ні ні, не сплю"
    
    "Я відкрив очі. І побачив Ханну."
    
    scene kitchen1
    with fade
    
    show hanna
    
    h "Тоді можеш починати їсти."
    
    "На вечерю були макарони зі смаженим яйцем і беконм."
    
    "Через 5 хвилин тарілка була пуста."
    
    e "Дякую Ханно, все було дуже смачне."
    
    h "Нема за що Еріку."
    
    scene farm
    with fade    
    
    "І я пішов до Тома у майстерню."
    
    play music gav
    
    "Я чую що хтось гавкає."
    
    "Я розвертаюся і бачу собаку."
    
    show dog
        
    d "Гав, гав."
    
    "Якщо чесно я боюся собак. Тому я почав з усієї швидкості бігти до майстерні Тома."
    
    "Я так швидко ніколи ще не біг."
    
    "Собака мене навздоганяла. Я вже добігав до майстерні Тома."
    
    scene mast
    with fade
    
    "Я вбіг в майстерню, але вже було пізно. Собака накинулась на мене."
    
    scene blak
    with fade
    
    stop music fadeout 0.5
    
    play music ruk
    
    "Я заплющив очі в очікувані смерті. Все життя проминуло в одну мить."
    
    "Я відчував як собака дихала в обличчя.Цей звір прибрив свою морду до моєї шиї щоб там замкнути свої гострі і безжальні зуби."
    
    "І настала ця мить. Я розумів що сопротивлятися було без смислено, тому я відав себе повністю цій тварині. Я був ще молодий помирати. І собака мене лизнула і ще раз." 
    
    stop music
    
    scene mast
    with fade
    
    show dog
    
    "Я розплющив очі і побачив цю ж собаку, яка за мною бігла."
    
    t "О, Еріку. А чому ти лежиш на підлозі."
    
    "Я повернувся в сторону голоса і побачив Тома."
    
    show tom at right
    
    e "Від собаки тікав."
    
    t "Від кого? Від, Ікла? Ой, Еріку в Ікла страшне тільки ім'я."
    
    e "А чому він за мною гнався?"
    
    t "Бо він отів з тобою привітатися."
    
    e "Зрозуміло. Ну привіт Ікло."
    
    d "Гав гав."
    
    e "Я прийшов сказати що я вже поприбирав у своїй кімнаті."
    
    t "Молодець. Йди відпочивай."
    
    e "Добре Томе."
    
    "Я вирішив піти до Ханни."
    
    scene farm
    with fade
    
    scene door_h
    with fade
    
    "Постукав у двері."
    
    "Тиша."
    
    "Я знову постукав."
    
    e "Ханно."
    
    "Я відкрив двері."
    
    scene room_h
    with fade
    
    "Але тут було порожньо. Тому я вирішив піти на кухню."
    
    scene kitchen1
    with fade
    
    "На кухні її теж не було."
    
    "Тому я пішов у свою кімнату."
    
    scene ber
    with fade
    
    "Я ліг на ліжко."
    
    scene blak
    with fade
    
    "Очі самі собою заплющилися. І я заснув."
    
    "Zzz"
    
    return
    
label room_h:
    
    scene blak
    with fade
    
    "Попрощавшись з батьками(вони виїжатимуть рано в ранці) я пішов до кімнати Ханни. Тобто своєї кімнати. Тобто до нашої з Ханною кімнату."
    
    scene room_h_n
    with fade
    
    show hanna
        
    "Я ліг канапі, а Ханна як завжди на своюму ліжку."
    
    hide hanna
     
    scene blak
    with fade
    
    h "Надобраніч Еріку."
    
    e "Надобраніч Ханно."
        
    "Zzz"
    
    c "Мяу мяу"
    
    "Я розплющив очі."
    
    scene room_h
    
    show cat
    
    "Я побачив кота."
    
    e "Привіт котику."
    
    "Ханна вже прокинулася.  Її ліжко було застелене."
    
    "Я пішов на кухню."
    
    scene kitchen1
    with fade
    
    show hanna
    with fade
    
    h "Добрий ранок, соння."
    
    e "Добрий ранок і тобі Ханно."
    
    e "А як звати твого кота?"
    
    h "Його звати Кігеть."
    
    e "Зрозуміло. Він мене розбудив."
    
    h "Еріку, не ображфйся Кіга. Він ж іще маленький котик."
    
    e "Та я й неображаюсь я люблю котів."
    
    h "Ясно."
    
    "Після сніданку я пішов до діда Тома."
    
    "Ханна мені сказала що він у майстерні."
    
    scene farm
    with fade
    
    "Я чую що хтось гавкає."
    
    "Я розвертаюся і бачу собаку."
    
    show dog
        
    d "Гав, гав."
    
    "Якщо чесно я боюся собак. Тому я почав з усієї швидкості бігти до майстерні Тома."
    
    "Я так швидко ніколи ще не біг."
    
    "Собака мене навздоганяла. Я вже добігав до майстерні Тома."
    
    scene mast
    with fade
    
    "Я вбіг в майстерню, але вже було пізно. Собака накинулась на мене."
    
    scene blak
    with fade
    
    "Я заплющив очі в очікувані смерті. Все життя проминуло в одну мить."
    
    "Я відчував як собака дихала в обличчя.Цей звір прибрив свою морду до моєї шиї щоб там замкнути свої гострі і безжальні зуби."
    
    "І настала ця мить. Я розумів що сопротивлятися було без смислено, тому я відав себе повністю цій тварині. Я був ще молодий помирати. І собака мене лизнула і ще раз." 
    
    scene mast
    with fade
    
    show dog
    
    "Я розплющив очі і побачив цю ж собаку, яка за мною бігла."
    
    t "О, Еріку. А чому ти лежиш на підлозі."
    
    "Я повернувся в сторону голоса і побачив діда Тома."
    
    show tom at right
    
    e "Від собаки тікав."
    
    t "Від кого? Від, Ікла? Ой, Еріку в Ікла страшне тільки ім'я."
    
    e "А чому він за мною гнався?"
    
    t "Бо він отів з тобою привітатися."
    
    e "Зрозуміло. Ну привіт Ікло."
    
    d "Гав гав."
    
    e "Добрий ранок діду Томе."
    
    t "І тобі Еріку добрий ранок. Тільки зви мене просто Том.Добре?"
    
    e "Так ді.. тобто Томе."
    
    t "А тепер йди до Ханни. Тепер ти повністю в її розпорядженні."
    
    "Том залився сміхом."
    
    e "Добре Томе."
    
    "Я пішов на кухню."
    
    scene farm
    with fade
    
    scene kitchen1
    with fade
    
    show hanna
    
    e "Привіт Ханно, я  весь в твоюму розпорядженні."
    
    h "Привіт Еріку. Тоді пішли у хлів."
    
    scene farm
    with fade
    
    scene hliv
    with fade
    
    return
    
    
    
    
    
    
    
    
    
    
    



